package file2;
public class failure {
    //Создаём функцию
    public int removeElementInplace(int[] arr, int val) {
        //Вводим ограничения по размеру элементов массива, длинне и числу вал,
        // которые в задании написаны
        if (arr.length > 100 || arr.length < 0) {
            return -1;
        }
        if (val < 0 || val > 100) {
            return -1;
        }
        for (int i = 0; i < arr.length; i++) {
            if (arr[i] > 50 || arr[i] < 0) {
                return -1;
            }
        }
        //Создаём переменную, которая будет отслеживать размер нового массива
        //(уменьшаться при нахождении числа вал)
        int noviyrazmer = arr.length;
        //Создаём переменную, которая будет отслеживать
        //В какие места нужно сдвигать массив
        int pozishn = -1;
        for (int i = 0; i < arr.length; i++) {
            //Пока нету вала всё окей, идём дальше
            if (arr[i] != val) {
                if (pozishn == -1) {
                    continue;
                }
                else {
                    //Если вал нам встретился, то позишн запомнил его индекс
                    //и будет сдвигать весь массив начиная с этого места
                    //постоянно увеличиваясь, таким образом числа отсортируются, а число вал
                    //будет игнорироваться и сортировка пройдёт без него
                    arr[pozishn] = arr[i];
                    pozishn += 1;
                }
            }
            else {
                //если встретилось число вал, размер нового массива уменьшается
                //и позишну присваивается индекс первого обнаруженного числа вал
                //массив при появлении числа вал не сдвигается, а скипает этот проход
                //ищет следующее не вал число и сортируется дальше
                noviyrazmer -= 1;
                if (pozishn == -1) {
                    pozishn = i;
                }
                continue;
            }
        }
        //выводим новый размер
        return noviyrazmer;
    }
}
